WD_Soap_Demo/Worker_Benefits_MCR.wsdl

<?xml version='1.0' encoding='UTF-8'?><wsdl:definitions xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:wd="urn:com.workday.report/Worker_Benefits_MCR" xmlns:nyw="urn:com.netyourwork/aod" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapbind="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:httpbind="http://schemas.xmlsoap.org/wsdl/http/" xmlns:mimebind="http://schemas.xmlsoap.org/wsdl/mime/" name="Report" targetNamespace="urn:com.workday.report/Worker_Benefits_MCR"><wsdl:documentation></wsdl:documentation><wsdl:types><xsd:schema elementFormDefault="qualified" attributeFormDefault="qualified" targetNamespace="urn:com.workday.report/Worker_Benefits_MCR"><xsd:element name="Report_Data" type="wd:Report_DataType"/><xsd:element name="Execute_Report" type="wd:Execute_ReportType"/><xsd:simpleType name="RichText"><xsd:restriction base="xsd:string"/></xsd:simpleType><xsd:simpleType name="WorkerReferenceEnumeration"><xsd:restriction base="xsd:string"><xsd:annotation><xsd:appinfo><wd:enumeration xmlns:wd="urn:com.workday/bsvc" value="WID"/><wd:enumeration xmlns:wd="urn:com.workday/bsvc" value="Contingent_Worker_ID"/><wd:enumeration xmlns:wd="urn:com.workday/bsvc" value="Employee_ID"/></xsd:appinfo></xsd:annotation></xsd:restriction></xsd:simpleType><xsd:simpleType name="Unique_IdentifierReferenceEnumeration"><xsd:restriction base="xsd:string"><xsd:annotation><xsd:appinfo><wd:enumeration xmlns:wd="urn:com.workday/bsvc" value="IID"/><wd:enumeration xmlns:wd="urn:com.workday/bsvc" value="WID"/></xsd:appinfo></xsd:annotation></xsd:restriction></xsd:simpleType><xsd:complexType name="Report_ParametersType"><xsd:sequence><xsd:element name="Worker" type="wd:WorkerObjectType" minOccurs="0" maxOccurs="unbounded"/></xsd:sequence></xsd:complexType><xsd:complexType name="Report_EntryType"><xsd:sequence><xsd:element name="Employee_ID" type="xsd:string" minOccurs="0"/><xsd:element name="Full_Legal_Name" type="xsd:string" minOccurs="0"/><xsd:element name="Benefit_Enrollments" type="wd:Unique_IdentifierObjectType" minOccurs="0" maxOccurs="unbounded"/></xsd:sequence></xsd:complexType><xsd:complexType name="WorkerObjectType"><xsd:annotation xmlns:wstxns1="urn:com.workday/bsvc" wstxns1:Is_Reference_ID="1"/><xsd:sequence><xsd:element name="ID" type="wd:WorkerObjectIDType" minOccurs="0" maxOccurs="unbounded"/></xsd:sequence><xsd:attribute name="Descriptor" type="xsd:string"><xsd:annotation><xsd:documentation>Display information used to describe an instance of an object. This 'optional' information is for outbound descriptive purposes only and is not processed on inbound Workday Web Services requests.</xsd:documentation></xsd:annotation></xsd:attribute></xsd:complexType><xsd:complexType name="Unique_IdentifierObjectType"><xsd:annotation xmlns:wstxns2="urn:com.workday/bsvc" wstxns2:Is_Reference_ID="1"/><xsd:sequence><xsd:element name="ID" type="wd:Unique_IdentifierObjectIDType" minOccurs="0" maxOccurs="unbounded"/></xsd:sequence><xsd:attribute name="Descriptor" type="xsd:string"><xsd:annotation><xsd:documentation>Display information used to describe an instance of an object. This 'optional' information is for outbound descriptive purposes only and is not processed on inbound Workday Web Services requests.</xsd:documentation></xsd:annotation></xsd:attribute></xsd:complexType><xsd:complexType name="WorkerObjectIDType"><xsd:annotation><xsd:documentation>Contains a unique identifier for an instance of an object.</xsd:documentation></xsd:annotation><xsd:simpleContent><xsd:extension base="xsd:string"><xsd:attribute name="type" type="wd:WorkerReferenceEnumeration" use="required"><xsd:annotation><xsd:documentation>The unique identifier type. Each "ID" for an instance of an object contains a type and a value. A single instance of an object can have multiple "ID" but only a single "ID" per "type".</xsd:documentation></xsd:annotation></xsd:attribute></xsd:extension></xsd:simpleContent></xsd:complexType><xsd:complexType name="Unique_IdentifierObjectIDType"><xsd:annotation><xsd:documentation>Contains a unique identifier for an instance of an object.</xsd:documentation></xsd:annotation><xsd:simpleContent><xsd:extension base="xsd:string"><xsd:attribute name="type" type="wd:Unique_IdentifierReferenceEnumeration" use="required"><xsd:annotation><xsd:documentation>The unique identifier type. Each "ID" for an instance of an object contains a type and a value. A single instance of an object can have multiple "ID" but only a single "ID" per "type".</xsd:documentation></xsd:annotation></xsd:attribute></xsd:extension></xsd:simpleContent></xsd:complexType><xsd:complexType name="Report_DataType"><xsd:sequence><xsd:element name="Report_Entry" type="wd:Report_EntryType" minOccurs="0" maxOccurs="unbounded"/></xsd:sequence></xsd:complexType><xsd:complexType name="Execute_ReportType"><xsd:sequence><xsd:element name="Report_Parameters" type="wd:Report_ParametersType" minOccurs="0"/><xsd:element name="Authentication" type="wd:AuthenticationType" minOccurs="0"/></xsd:sequence></xsd:complexType><xsd:complexType name="MoneyType"><xsd:simpleContent><xsd:extension base="xsd:decimal"><xsd:attribute name="Currency_Code" type="xsd:string"/></xsd:extension></xsd:simpleContent></xsd:complexType><xsd:complexType name="AuthenticationType"><xsd:sequence><xsd:element name="Proxy_User_Name" type="xsd:string" minOccurs="0" maxOccurs="1"/></xsd:sequence></xsd:complexType></xsd:schema></wsdl:types><wsdl:message name="RequestMsg"><wsdl:part name="Worker" type="xsd:string"/><wsdl:part name="Proxy_User_Name" type="xsd:string"/></wsdl:message><wsdl:message name="Report_DataOutputMsg"><wsdl:part name="body" element="wd:Report_Data"/></wsdl:message><wsdl:message name="ResponseMsg"><wsdl:part name="body" type="wd:Report_DataType"/></wsdl:message><wsdl:message name="Execute_ReportInputMsg"><wsdl:part name="body" element="wd:Execute_Report"/></wsdl:message><wsdl:portType name="ReportPortREST"><wsdl:operation name="Execute_Report"><wsdl:input name="Execute_ReportInput" message="wd:RequestMsg"/><wsdl:output name="Execute_ReportOutput" message="wd:ResponseMsg"/></wsdl:operation></wsdl:portType><wsdl:portType name="ReportPort"><wsdl:documentation></wsdl:documentation><wsdl:operation name="Execute_Report"><wsdl:input name="Execute_ReportInput" message="wd:Execute_ReportInputMsg"/><wsdl:output name="Execute_ReportOutput" message="wd:Report_DataOutputMsg"/></wsdl:operation></wsdl:portType><wsdl:binding name="ReportBinding" type="wd:ReportPort"><soapbind:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/><wsdl:operation name="Execute_Report"><soapbind:operation style="document"/><wsdl:input name="Execute_ReportInput"><soapbind:body use="literal"/></wsdl:input><wsdl:output name="Execute_ReportOutput"><soapbind:body use="literal"/></wsdl:output></wsdl:operation></wsdl:binding><wsdl:binding name="ReportRESTBinding" type="wd:ReportPortREST"><httpbind:binding verb="GET"/><wsdl:operation name="Execute_Report"><httpbind:operation location="Execute_Report"/><wsdl:input><httpbind:urlEncoded/></wsdl:input><wsdl:output><mimebind:content type="text/xml" part="body"/></wsdl:output></wsdl:operation></wsdl:binding><wsdl:service name="ReportService"><wsdl:port name="Report" binding="wd:ReportBinding"><soapbind:address location="https://wd2-impl-services1.workday.com/ccx/service/Report2/collaborative_dpt2/mrichen-impl/Worker_Benefits_MCR"/></wsdl:port><wsdl:port name="ReportREST" binding="wd:ReportRESTBinding"><httpbind:address location="https://wd2-impl-services1.workday.com/ccx/service/customreport2/collaborative_dpt2/mrichen-impl/Worker_Benefits_MCR"/></wsdl:port></wsdl:service></wsdl:definitions>